import { useToast } from "native-base"
import React, { createContext, useContext, useRef, useState } from "react"
import { useForm } from "react-hook-form"
import { Platform } from "react-native"
import { AnganwadiApi } from "../api/AnganwadiApi"
import { navigate } from "../navigators"
import { useCommanContextContext } from "./CommanContext"
import { useLoginContext } from "./LoginContext"

interface SchemeContextInterface {
  onPressToView: Function
  schemeInfo: any
}
const SchemeContext = createContext<null | SchemeContextInterface>(null)

type SchemeContextProps = { children: React.ReactNode }

export const SchemeContextProvider = ({ children }: SchemeContextProps) => {
  const { schemeList } = useLoginContext()
  
  const schemeInformationData = [
    {
      id: 1,
      icon: require("../../assets/govSchemeImages/1.png"),
      schemeTitle: "माझी कन्या भाग्यश्री",
      Info: "राज्यातील मुलींचा जन्मदर वाढविणे, त्यांच्या आरोग्याचा दर्जा वाढवणे, त्यांना शिक्षण देणे, स्त्रीभ्रूणहत्या रोखणे, बालविवाहास प्रतिबंध करणे या उद्दिष्टांसाठी शासन निर्णयान्वये सुकन्या योजना दिनांक १ जानेवारी २०१४ पासून लागू करण्यात आलेली आहे. या योजनेअंतर्गत राज्यातील दारिद्र्य रेषेखालील जन्मणाऱ्या प्रत्येक मुलीच्या नावे रुपये २१,२००/- मुलीच्या जन्माच्या एका वर्षाच्या आत आयुर्विमा महामंडळाच्या योजनेत गुंतवून सदर मुलीस वयाची १८ वर्षे पूर्ण झाल्यानंतर एकूण रुपये १ लाख एवढी रक्कम प्रदान करण्यात येईल. अशी तरतूद या योजनेअंतर्गत करण्यात आलेली आहे.",
    },
    {
      id: 2,
      icon: require("../../assets/govSchemeImages/2.png"),
      schemeTitle: "बेटी बचाओ बेटी पढाओ",
      Info: "या योजनेची सुरुवात माननीय पंतप्रधाणांनी २२ जानेवारी २०१५ रोजी पानिपत,हरियाणा येथे सुरुवात केली. या योजनेचा उद्देश असा आहे कि, मुलींचे शोषणापासून संरक्षण करणे आणि त्यांना योग्य/अयोग्यतेची जाणीव करून देणे . या योजनेमुळे मुलींना उच्च शिक्षण घेण्यास मदत होईल. या योजनेमुळे मुलींना स्वतंत्रपणे आयुष्य जगता येणार. त्यांना त्याच उच्च शिक्षण पूर्ण करण्यास मद्दत होईल आणि त्यांना त्यांच ध्येय गाठता येईल.बेटी बचाओ बेटी पढाओ योजनेमुळे मुलींच्या संख्येत जी घट पाहायला येत होती ती या योजनेमुळे नक्कीच भरून निघणार आहे. या योजनेचा मुख्य उद्देश मुलींना शिक्षणाच्या माध्यमातून सामाजिक आणि आर्थिकदृष्ट्या स्वतंत्र करणे हा आहे. लोकांना याची जाणीव करून देणे आणि महिलांसाठी कल्याणकारी सेवांचे वितरण सुधारणे.",
    },
    {
      id: 3,
      schemeTitle: "बेबी केअर किट",
      icon: require("../../assets/govSchemeImages/3.png"),
      Info: "बेबी केअर कीट योजना महाराष्ट्र शासनाने  26 जानेवारी 2019 पासुन सुरु करण्यात आली आहे. आपल्याला  शासकीय रुग्णालय अथवा प्राथमिक आरोग्य केंद्र मध्ये पहिल्या प्रसूतीवेळी जन्माला येणाऱ्या नवजात बाळाला 2 हजार रुपये किमतीचे बाळाच्या उपयोगातील “बेबी केअर किट” चा लाभ मिळणार आहे.शासकीय प्राथमिक आरोग्य केंद्रात गरोदरपणाची नाव नोंदणी केलेल्या व प्रसुत झाल्यानंतर 2 महिन्याच्या आत अर्ज सादर करणाऱ्या महिलांना पहिल्या प्रसुतीच्या वेळी बेबी केअर कीट मिळणार यामध्ये नवजात बालकाचे कपडे, टॉवेल, मच्छरदाणी अंगाला लावायला तेल, बॅल्केट, प्लास्टीक चटई, शाम्पू, नेलकटर, खेळणी, हातमोजे – पायमोजे, आईसाठी हात धुण्यासाठी लिक्विड, बॉडी वॉश लिक्विड झोपण्याची लहाण गादी इ प्रकारचे व सर्व साहित्य ठेवण्यासाठी लहान बॅग  यांचा समावेश आहे.",
    },
    {
      id: 4,
      schemeTitle: "तरंग सुपोषित महाराष्ट्र",
      icon: require("../../assets/govSchemeImages/4.png"),
      Info: "‘तरंग सुपोषित महाराष्ट्राचा' हा आय. व्ही. आर. (इंटरॲक्टिव्ह वॉइस रिस्पॉन्स) प्रणालीवर आधारित डिजिटल सोशल मीडिया प्लॅटफॉर्म आहे. या माध्यमातून घराघरात जाऊन स्तनदा माता, बालकांचे पालक यांच्याशी संवाद साधून सुपोषणाबाबत माहिती, मार्गदर्शन केले जाणार आहे. पोषणविषयक जनजागृतीसाठी हा प्लॅटफॉर्म उपयुक्त ठरेल, असा विश्वास श्रीमती ठाकूर यांनी व्यक्त केला आहे.‘तरंग सुपोषित महाराष्ट्राचा' मधे हेल्पलाइन, ब्रॉडकास्ट कॉल, व्हॉट्सॲप चॅटबोटचा समावेश आहे.‘एक घास मायेचा' ही खास पाककृतींची व्हिडीओ मालिका तयार करण्यात आली असून त्याद्वारे खास माता आणि बालकांसाठी विविध पाककृतींचे प्रात्यक्षिक आदी दाखविण्यात येणार आहे. 'आजीबाईच्या गुजगोष्टी' या ॲनिमेटेड मालिकेतून लोकांच्या मानसिक परिवर्तनाबाबत रंजक गोष्टींच्या माध्यमातून संदेश दिले जाणार आहेत. ",
    },
    {
      id: 5,
      schemeTitle: "स्थलांतरित बालके",
      icon: require("../../assets/govSchemeImages/5.png"),
      Info: "स्थलांतरित विद्यार्थ्यांना शिक्षण मिळावे यासाठी देशात शिक्षण हक्क कायदा, २००९ची अंमलबजावणी करण्यात आली आहे. यानुसार विविध राज्यांनी त्यांच्या स्तरावर स्थलांतरित विद्यार्थ्यांना मुख्य प्रवाहात आणून शिक्षण देण्यासाठी विविध योजना आखल्या आहेत. यासाठी थेट मुलांना शाळेत प्रवेशित करून घेण्यापासून ते कामाच्या ठिकाणी तात्पुरती शाळा उपलब्ध करून देण्यापर्यंत विविध उपायायोजना करण्यात आल्या आहेत. मात्र त्या अधिक प्रभावीपणे होणे आवश्यक आहे.",
    },
    {
      id: 6,
      schemeTitle: "मिशन वात्सल्य",
      icon: require("../../assets/govSchemeImages/6.png"),
      Info: "मिशन वात्सल्य याला वात्सल्य मैत्री अमृत कोष असेही म्हणतात. या मिशनच्या नावाप्रमाणेच, हा एक दूरदर्शी प्रयत्न आहे ज्याद्वारे स्तनपानाला प्रोत्साहन देण्यासाठी आणि बालमृत्यू कमी करण्यासाठी प्रयत्न केले जात आहेत. यंदाच्या अर्थसंकल्पीय घोषणेमध्ये केंद्र सरकार मिशन वात्सल्य पुढे नेणार असून अर्भक आणि मातांच्या हितासाठी प्रयत्नशील राहणार असल्याचे सामायिक करण्यात आले आहे. महिला आणि बालविकास मंत्रालयानेही आपल्या मुख्य योजनांची तीन भागात विभागणी केली आहे. यामध्ये त्यांनी सर्व महत्त्वाच्या योजना मिशन पोशन २.o, मिशन शक्ती आणि मिशन वात्सल्य अशा तीन विभागात विभागल्या आहेत. याचा अर्थ मिशन वात्सल्य ही देखील महिला आणि बाल विकास मंत्रालयाच्या तीन छत्री योजनांपैकी एक आहे.",
    },
    {
      id: 7,
      schemeTitle: "चाइल्डलाइन",
      icon: require("../../assets/govSchemeImages/7.png"),
      Info: "चाइल्डलाइन इंडिया 1098 ही एक टेलिफोन हेल्पलाइन सेवा आहे जी चाइल्डलाइन इंडिया फाउंडेशन, भारतातील एनजीओ द्वारे चालवली जाते . मुलांच्या हिताचे रक्षण करण्यासाठी दिवसाचे 24 तास, आठवड्याचे सातही दिवस चालवली जाणारी ही भारतातील पहिली मोफत टेलिफोन सेवा आहे. हे अनाथ आणि निराधार आणि गरीब मुलांना मदत करते जे शाळेत जाऊ शकत नाहीत. त्यांच्या शिक्षणाचेही व्यवस्थापन करते. ही संस्था आपल्या कामांसाठी लोकांकडून पैसे गोळा करते. त्यात वर्षाला सरासरी दोन लाख कॉल्स येतात. बालमजुरीपासून मुक्ती मिळवण्यासाठी बहुतेक फोन वापरले जातात.",
    },
    {
      id: 8,
      schemeTitle: "ग्राम बाळ संरक्षण समिती",
      icon: require("../../assets/govSchemeImages/8.png"),
      Info: "बाल न्याय (काळजी व संरक्षण) अधिनियम २०१५ च्या कलम १०६ नुसार १८ वर्षाखालील मुलांचे सगळ्या प्रकारच्या शोषणापासून, अत्याचारापासून संरक्षण मिळवण्यासाठी आणि सुरक्षित वातावरण निर्माण करण्यासाठी तयार करण्यात आलेली समिती होय. या दृष्टीनेच शासनाने १० जून २०१४ रोजी हे परिपत्रक काढले.बालन्याय (मुलांची काळजी व संरक्षण) नियम २००० (२००६) (JJ Care & Projection of Children) Act 2000 (2006) च्या कलम ८१ (फ) व महाराष्ट्र बाल न्याय (मुलांची काळजी व संरक्षण) सुधारित नियम २०११ च्या कलम १४ (११-२) च्या द नुसार प्रभावी अंमलबजावणी करिता जिल्हा, तालुका, नगर आणि ग्रामस्तरावर बाल संरक्षण समिती उभारण्याची तसेच तिची कार्ये पार पाडण्याची पध्दती सुनिश्चित करण्यात आली.",
    },
    {
      id: 9,
      schemeTitle: "बालविवाह निर्मूलन",
      icon: require("../../assets/govSchemeImages/9.png"),
      Info: "बालविवाहासाठी दोषी ठरलेल्या सर्व व्यक्तींना दोन वर्षांपर्यंत वाढू शकेल अशा मुदतीसाठी किंवा एक लाख रुपयांपर्यंतचा दंड, किंवा दोन्ही शिक्षा होऊ शकतात. या कायद्यात मुलांसाठी विवाहाचे किमान वय २१ वर्षे आणि मुलींचे १८ वर्षे निश्चित करण्यात आले आहे.बालविवाह रोखण्यासाठी आणि लग्न करणाऱ्यांना शिक्षा करण्यासाठी वेळोवेळी कायदे करण्यात आले असले तरी बालविवाह प्रतिबंध कायदा 2006 मध्ये बालविवाह रोखण्यासाठी आणि बालविवाह करणार्‍यांना कठोर शिक्षा करण्याच्या तरतुदी आहेत.",
    },
    {
      id: 10,
      schemeTitle: "बाल आधार नोंदणी",
      icon: require("../../assets/govSchemeImages/10.png"),
      Info: "5 वर्षांखालील सर्व मुलांसाठी बाल आधार कार्ड बनवले जाईल. मुलांसाठी बनवलेल्या कार्डचा रंग निळा असेल. युनिक आयडेंटिफिकेशन ऑथॉरिटी ऑफ इंडियाने ५ वर्षांखालील सर्व मुलांसाठी आधार कार्ड बनवण्याची घोषणा केली आहे. ही निळी कार्डे बालके 5 वर्षांची होईपर्यंतच वैध असतील. यानंतर त्यांना नवीन कार्ड बनवावे लागतील ज्यामध्ये त्यांचे बायोमेट्रिक तपशील देखील जोडले जातील. याआधी मुलांचे आधार फक्त पालकांच्या आधारशी लिंक केले जातील. त्यासाठी पालकांची कागदपत्रेही लागणार आहेत. पुढे, आम्ही मुलांचे आधार कार्ड अर्ज आणि कागदपत्रे इत्यादींची माहिती देखील देऊ जेणेकरून तुम्हाला हे कार्ड सहज बनवता येईल.",
    },
    {
      id: 11,
      schemeTitle: "डॉ.अब्दुल कलाम अमृत आहार योजना",
      icon: require("../../assets/surveyimages/MainMenu/DrAPJKalam.png"),
      Info: `आदिवासी भागातील गर्भवती आणि स्तनपान देणाऱ्या मातांना चौरस जेवण पुरविणे.
          योजनेअंतर्गत गरोदर स्त्रियांना शेवटच्या तिमाहीत व स्तनदा मातांना बाळंतपणानंतर पहिल्या तिमाहीत याप्रमाणे सहा महिन्याच्या कालावधीकरिता एक वेळचा चौरस आहार देण्यात येईल.
          आहाराचा दर्जा, किंमत व पोषण मुल्ये ही शासन निर्णयातील परिशिष्ट-ब प्रमाणे राहतील व प्रति लाभार्थी चौरस आहाराचा सरासरी खर्च रु.२५/- एवढा राहील.`,
    },
  ]
  const [schemeInfo, setSchemeInfo] = useState<any>(null)

  const onPressToView = (id: number | string) => {
    setSchemeInfo(schemeList?.find((item: any) => item.id === id))
    navigate("GovermentScheme")
  }
  const value: SchemeContextInterface = {
    onPressToView,
    schemeInfo,
  }
  return <SchemeContext.Provider value={value}>{children}</SchemeContext.Provider>
}

export const useSchemeContext = () => {
  const context = useContext(SchemeContext)
  if (!context) throw new Error("use Scheme context use in Scheme context provider")
  return context
}
