export const questions = [
    //  age 3-4 years
    // शारीरिक आणि कारक विकास
    {
      id: 1,
      question: "खेळाच्या वेळी सक्रियपणे सहभागी होता येते. (वर्गात / बाहेर)?",
    },
    {
      id: 2,
      question: "दोन्ही हातांनी मोठा चेंडू फेकता येतो?",
    },
    {
      id: 3,
      question: "एका जागी उडी मारता येते?",
    },
    {
      id: 4,
      question: "मणी ओवता येतात?",
    },
    {
      id: 5,
      question: "खडूने मोठ्या आकारात रंग भरता येतो?",
    },
    // ज्ञानेंद्रियांचा, संवेदनात्मक व बोधात्मक विकास
    {
      id: 6,
      question: "वेगवेगळे वास, चवी, आवाज आणि पोत इ. ओळखता येतात?",
    },
    {
      id: 7,
      question: "रंग ओळखता येतात (पिवळा, लाल, निळा)?",
    },
    {
      id: 8,
      question: " एखाद्या निकषानुसार वस्तूंचे वर्गीकरण करता येते. उदा. सगळे गोल किंवा सगळ्या लाल वस्तू इ?",
    },
    {
      id: 9,
      question: "तीन तुकड्यांचे सोपे पझल (जुळणी-कोडे) किंवा मेझ (जाळे/व्यूह) सोडवता येते?",
    },
    {
      id: 10,
      question: "वेगवेगळ्या आकारांच्या दिलेल्या आकृतीबंधाची (पॅटर्न) पुनरावृत्ती करता येते?",
    },
    // भाषा, साक्षरता आणि संवाद
    {
      id: 11,
      question: "सोप्या सूचनांचे समजून पालन करता येते.?",
    },
    {
      id: 12,
      question: "हातवारे, शब्द किंवा सोप्या वाक्यांतून भावना किंवा कल्पना प्रकट करता येतात?",
    },
    {
      id: 13,
      question: "गोष्टींची पुस्तके पाहायला आणि चित्रवाचन करायला आवडते?",
    },
    {
      id: 14,
      question: "पूर्ण वाक्यात एखाद्या चित्रांचे वर्णन करता येते?",
    },
    {
      id: 15,
      question: "स्वतःचे (लिहिलेले) नाव ओळखता येते?",
    },
    // वैयक्तिक- सामाजिक व भावनिक विकास
    {
      id: 16,
      question: "मुलांच्या गटात खेळायला आवडते?",
    },
    {
      id: 17,
      question: "ओळखीच्या लोकांशी सहज संवाद साधता येतो?",
    },
    {
      id: 18,
      question: "मित्र / समवयस्कांसोबत खेळणी वाटून घेतो/घेते?",
    },
    {
      id: 19,
      question: "खेळताना स्वतःची पाळी येईपर्यंत वाट पाहता येते?",
    },
    {
      id: 20,
      question: "आनंद, दुःख, राग अशा साध्यासोप्या भावना ओळताना आणि प्रकट करता येतात?",
    },
    // सर्जनशीलता
    {
      id: 21,
      question: "नवीन गोष्टी शिकायचे कुतूहल असते आणि त्यात रस घेतो/घेते?",
    },
    {
      id: 22,
      question: "खोटेखोटे नाटक करत खेळायला आवडते, जसे की बाहुलीघरात खेळणे, दुकानदार असल्याचे नाटक करणे, इ?",
    },
    {
      id: 23,
      question: "दैनंदिन गोष्टींमध्ये कल्पकता दाखवतो/दाखवते (उदा. वस्तूंचे किंवा शब्दांचे वेगळ्या, नव्या प्रकारे प्रयोग करून पाहणे?",
    },
    {
      id: 24,
      question: "नृत्य, नाटक, संगीताच्या उपक्रमांत सहभाग घेतो?",
    },
    {
      id: 25,
      question: "चित्र काढताना, कलानिर्मितीत आणि एखादा प्रश्न सोडवताना कल्पनाशक्तीचा वापर करता येतो?",
    },
  
    //  age 4-5 years
    // शारीरिक आणि कारक विकास
    {
      id: 1,
      question: "खेळाच्या वेळी सक्रियपणे सहभागी होता येते. (वर्गात / बाहेर)?",
    },
    {
      id: 2,
      question: "मोठा चेंडू फेकता, लाथेने उडवता व पकडता येतो?",
    },
    {
      id: 3,
      question: "हळू आणि जोरात पळता येते?",
    },
    {
      id: 4,
      question: "दिलेल्या क्रमाने मणी ओवता येतात?",
    },
    {
      id: 5,
      question: "ठिपके जोडून आकार / आकृती काढता येते?",
    },
    // ज्ञानेंद्रियांचा, संवेदनात्मक व बोधात्मक विकास
    {
      id: 6,
      question: "वास, चवी आणि पोत इ. नुसार वेगवेगळ्या वस्तूंचे वर्गीकरण करता येते?",
    },
    {
      id: 7,
      question: "दोन संकल्पनांनुसार (आकार व रंग) वस्तुंचे वर्गीकरण करता येते. उदा पिवळे गोल?",
    },
    {
      id: 8,
      question: "साधासोपा आकृतीबंध (पॅटर्न) पूर्ण करता येतो?",
    },
    {
      id: 9,
      question: "पाच तुकड्यांचे सोपे पझल (जुळणी-कोडे) किंवा मेझ (जोळ / व्यूह) सोडवता येते?",
    },
    {
      id: 10,
      question: "पाचपर्यंत वस्तू मोजता येतात आणि त्या-त्या आकडयाशी त्यांची जोडी लावता येते?",
    },
    // भाषा, साक्षरता आणि संवाद
    {
      id: 11,
      question: "संभाषणे आणि गोष्टी लक्षपूर्वक ऐकतो/ ऐकते?",
    },
    {
      id: 12,
      question: "भावना आणि कल्पना साध्या वाक्यांमधून प्रकट करता येतात आणि प्रश्न विचारता येतात?",
    },
    {
      id: 13,
      question: "सुयोग्य शब्दसंग्रह वापरु आधी ऐकलेला एखादा घनाक्रम कथन करता येतो?",
    },
    {
      id: 14,
      question: "पुस्तके, इतर छापील साहित्य पाहायला आवडते व छापलेल्या शाब्दांची उकल करण्यात रस घेतो?",
    },
    {
      id: 15,
      question: "दिलेला शब्दातला पहिला ध्वनी ओळखता येतो?",
    },
    // वैयक्तिक- सामाजिक व भावनिक विकास
    {
      id: 16,
      question: "मुलांच्या गटात खेळायला आवडते?",
    },
    {
      id: 17,
      question: "ओळखीच्या लोकांशी सहज संवाद साधता येतो?",
    },
    {
      id: 18,
      question: "मित्र / समवयस्कांसोबत खेळणी वाटून घेतो/घेते?",
    },
    {
      id: 19,
      question: "खेळताना स्वतःची पाळी येईपर्यंत वाट पाहता येते?",
    },
    {
      id: 20,
      question: "आनंद, दुःख, राग अशा साध्यासोप्या भावना ओळताना आणि प्रकट करता येतात?",
    },
    // सर्जनशीलता
    {
      id: 21,
      question: "नवीन गोष्टी शिकायचे कुतूहल असते आणि त्यात रस घेतो/घेते?",
    },
    {
      id: 22,
      question: "खोटेखोटे नाटक करत खेळायला आवडते, जसे की बाहुलीघरात खेळणे, दुकानदार असल्याचे नाटक करणे, इ?",
    },
    {
      id: 23,
      question: "दैनंदिन गोष्टींमध्ये कल्पकता दाखवतो/दाखवते (उदा. वस्तूंचे किंवा शब्दांचे वेगळ्या, नव्या प्रकारे प्रयोग करून पाहणे?",
    },
    {
      id: 24,
      question: "नृत्य, नाटक, संगीताच्या उपक्रमांत सहभाग घेतो?",
    },
    {
      id: 25,
      question: "चित्र काढताना, कलानिर्मितीत आणि एखादा प्रश्न सोडवताना कल्पनाशक्तीचा वापर करता येतो?",
    },
  
    
    //  age 5-6 years
    // शारीरिक आणि कारक विकास
    {
      id: 1,
      question: "सांधिक खेळांत आणि वर्गात खेळताना सक्रियपणे सहभागी होता येते ?",
    },
    {
      id: 2,
      question: "सागितलेल्या दिशेने चेंडू फेकता / लाथेने मारता येतो?",
    },
    {
      id: 3,
      question: "सरळ पुढे / उलटे मागे / एका बाजूला चालता येते ?",
    },
    {
      id: 4,
      question: "मणी ओवून विशिष्ट रचना करता येते?",
    },
    {
      id: 5,
      question: "ठिपके जाडून गुंतागुंतीची आकृती काढता येते?",
    },
    // ज्ञानेंद्रियांचा, संवेदनात्मक व बोधात्मक विकास
    {
      id: 6,
      question: "वास, चवी आणि पोत इ. नुसार वेगवेगळ्या वस्तूंचे वर्गीकरण करता येते?",
    },
    {
      id: 7,
      question: "तीन संकल्पनांनुसार आकार, रंग व लहानमोठया | आकारमानानुसार वस्तुंचे वर्गीकरण करता येते उदा. लहान पिवळे गोल?",
    },
    {
      id: 8,
      question: "गुंतागुंतीचा आकृतीबंध पॅटर्न पूर्ण करता येतो?",
    },
    {
      id: 9,
      question: "दोन चित्रांमधले फरक शोधता येतात ?",
    },
    {
      id: 10,
      question: "१० पर्यंत अंकज्ञान ओळखणे व वाचणे?",
    },
    // भाषा, साक्षरता आणि संवाद
    {
      id: 11,
      question: "संभाषणे आणि गोष्टी लक्षपूर्वक ऐकतो/ ऐकते?",
    },
    {
      id: 12,
      question: "भावना आणि कल्पना इतरांना सांगून / इतरांसमोर मांडून गोष्ट तयार करण्यात सहभाग घेतो/घेते?",
    },
    {
      id: 13,
      question: "पुस्तके व इतर छापील साहित्य पाहायला आवडते आणि काही ओळखीचे शब्द ओळखता येतात?",
    },
    {
      id: 14,
      question: "पुस्तके, इतर छापील साहित्य पाहायला आवडते व छापलेल्या शाब्दांची उकल करण्यात रस घेतो?",
    },
    {
      id: 15,
      question: "अक्षरे व त्या संबंधी आवाज ओळखणे?",
    },
    // वैयक्तिक- सामाजिक व भावनिक विकास
    {
      id: 16,
      question: "नियम असलेल्या खेळांमध्ये संघाचा सदस्य म्हणून खेळता येते?",
    },
    {
      id: 17,
      question: "ओळखीच्या लोकांशी सहज संवाद साधता येतो?",
    },
    {
      id: 18,
      question: "मित्र / समवयस्कांसोबत सहज खेळणी वाटून घेतो ?",
    },
    {
      id: 19,
      question: "खेळताना स्वतःची पाळी येईपर्यंत वाट पाहता येते?",
    },
    {
      id: 20,
      question: "आनंद, दुःख, राग अशा साध्यासोप्या भावना ओळताना आणि प्रकट करता येतात?",
    },
    // सर्जनशीलता
    {
      id: 21,
      question: "नवीन गोष्टी शिकायचे कुतूहल असते आणि त्यात रस घेतो/घेते?",
    },
    {
      id: 22,
      question: "खोटेखोटे नाटक करत खेळायला आवडते, जसे की बाहुलीघरात खेळणे, दुकानदार असल्याचे नाटक करणे, इ?",
    },
    {
      id: 23,
      question: "दैनंदिन गोष्टींमध्ये कल्पकता दाखवतो/दाखवते (उदा. दिलेल्या साहित्यातून विविध वस्तू बनवू शकतो)?",
    },
    {
      id: 24,
      question: "नृत्य, नाटक, संगीताच्या उपक्रमांत सहभाग घेतो?",
    },
    {
      id: 25,
      question: "चित्र काढताना, कलानिर्मितीत आणि एखादा प्रश्न सोडवताना कल्पनाशक्तीचा वापर करता येतो?",
    },
  ];



export const age3TO4=[
     //  age 3-4 years
    // शारीरिक आणि कारक विकास
    {
        id: 1,
        question: "खेळाच्या वेळी सक्रियपणे सहभागी होता येते. (वर्गात / बाहेर)?",
      },
      {
        id: 2,
        question: "दोन्ही हातांनी मोठा चेंडू फेकता येतो?",
      },
      {
        id: 3,
        question: "एका जागी उडी मारता येते?",
      },
      {
        id: 4,
        question: "मणी ओवता येतात?",
      },
      {
        id: 5,
        question: "खडूने मोठ्या आकारात रंग भरता येतो?",
      },
      // ज्ञानेंद्रियांचा, संवेदनात्मक व बोधात्मक विकास
      {
        id: 6,
        question: "वेगवेगळे वास, चवी, आवाज आणि पोत इ. ओळखता येतात?",
      },
      {
        id: 7,
        question: "रंग ओळखता येतात (पिवळा, लाल, निळा)?",
      },
      {
        id: 8,
        question: " एखाद्या निकषानुसार वस्तूंचे वर्गीकरण करता येते. उदा. सगळे गोल किंवा सगळ्या लाल वस्तू इ?",
      },
      {
        id: 9,
        question: "तीन तुकड्यांचे सोपे पझल (जुळणी-कोडे) किंवा मेझ (जाळे/व्यूह) सोडवता येते?",
      },
      {
        id: 10,
        question: "वेगवेगळ्या आकारांच्या दिलेल्या आकृतीबंधाची (पॅटर्न) पुनरावृत्ती करता येते?",
      },
      // भाषा, साक्षरता आणि संवाद
      {
        id: 11,
        question: "सोप्या सूचनांचे समजून पालन करता येते.?",
      },
      {
        id: 12,
        question: "हातवारे, शब्द किंवा सोप्या वाक्यांतून भावना किंवा कल्पना प्रकट करता येतात?",
      },
      {
        id: 13,
        question: "गोष्टींची पुस्तके पाहायला आणि चित्रवाचन करायला आवडते?",
      },
      {
        id: 14,
        question: "पूर्ण वाक्यात एखाद्या चित्रांचे वर्णन करता येते?",
      },
      {
        id: 15,
        question: "स्वतःचे (लिहिलेले) नाव ओळखता येते?",
      },
      // वैयक्तिक- सामाजिक व भावनिक विकास
      {
        id: 16,
        question: "मुलांच्या गटात खेळायला आवडते?",
      },
      {
        id: 17,
        question: "ओळखीच्या लोकांशी सहज संवाद साधता येतो?",
      },
      {
        id: 18,
        question: "मित्र / समवयस्कांसोबत खेळणी वाटून घेतो/घेते?",
      },
      {
        id: 19,
        question: "खेळताना स्वतःची पाळी येईपर्यंत वाट पाहता येते?",
      },
      {
        id: 20,
        question: "आनंद, दुःख, राग अशा साध्यासोप्या भावना ओळताना आणि प्रकट करता येतात?",
      },
      // सर्जनशीलता
      {
        id: 21,
        question: "नवीन गोष्टी शिकायचे कुतूहल असते आणि त्यात रस घेतो/घेते?",
      },
      {
        id: 22,
        question: "खोटेखोटे नाटक करत खेळायला आवडते, जसे की बाहुलीघरात खेळणे, दुकानदार असल्याचे नाटक करणे, इ?",
      },
      {
        id: 23,
        question: "दैनंदिन गोष्टींमध्ये कल्पकता दाखवतो/दाखवते (उदा. वस्तूंचे किंवा शब्दांचे वेगळ्या, नव्या प्रकारे प्रयोग करून पाहणे?",
      },
      {
        id: 24,
        question: "नृत्य, नाटक, संगीताच्या उपक्रमांत सहभाग घेतो?",
      },
      {
        id: 25,
        question: "चित्र काढताना, कलानिर्मितीत आणि एखादा प्रश्न सोडवताना कल्पनाशक्तीचा वापर करता येतो?",
      },
    
  ]

 export  const age4TO5=[
    {
        id: 1,
        question: "खेळाच्या वेळी सक्रियपणे सहभागी होता येते. (वर्गात / बाहेर)?",
      },
      {
        id: 2,
        question: "मोठा चेंडू फेकता, लाथेने उडवता व पकडता येतो?",
      },
      {
        id: 3,
        question: "हळू आणि जोरात पळता येते?",
      },
      {
        id: 4,
        question: "दिलेल्या क्रमाने मणी ओवता येतात?",
      },
      {
        id: 5,
        question: "ठिपके जोडून आकार / आकृती काढता येते?",
      },
      // ज्ञानेंद्रियांचा, संवेदनात्मक व बोधात्मक विकास
      {
        id: 6,
        question: "वास, चवी आणि पोत इ. नुसार वेगवेगळ्या वस्तूंचे वर्गीकरण करता येते?",
      },
      {
        id: 7,
        question: "दोन संकल्पनांनुसार (आकार व रंग) वस्तुंचे वर्गीकरण करता येते. उदा पिवळे गोल?",
      },
      {
        id: 8,
        question: "साधासोपा आकृतीबंध (पॅटर्न) पूर्ण करता येतो?",
      },
      {
        id: 9,
        question: "पाच तुकड्यांचे सोपे पझल (जुळणी-कोडे) किंवा मेझ (जोळ / व्यूह) सोडवता येते?",
      },
      {
        id: 10,
        question: "पाचपर्यंत वस्तू मोजता येतात आणि त्या-त्या आकडयाशी त्यांची जोडी लावता येते?",
      },
      // भाषा, साक्षरता आणि संवाद
      {
        id: 11,
        question: "संभाषणे आणि गोष्टी लक्षपूर्वक ऐकतो/ ऐकते?",
      },
      {
        id: 12,
        question: "भावना आणि कल्पना साध्या वाक्यांमधून प्रकट करता येतात आणि प्रश्न विचारता येतात?",
      },
      {
        id: 13,
        question: "सुयोग्य शब्दसंग्रह वापरु आधी ऐकलेला एखादा घनाक्रम कथन करता येतो?",
      },
      {
        id: 14,
        question: "पुस्तके, इतर छापील साहित्य पाहायला आवडते व छापलेल्या शाब्दांची उकल करण्यात रस घेतो?",
      },
      {
        id: 15,
        question: "दिलेला शब्दातला पहिला ध्वनी ओळखता येतो?",
      },
      // वैयक्तिक- सामाजिक व भावनिक विकास
      {
        id: 16,
        question: "मुलांच्या गटात खेळायला आवडते?",
      },
      {
        id: 17,
        question: "ओळखीच्या लोकांशी सहज संवाद साधता येतो?",
      },
      {
        id: 18,
        question: "मित्र / समवयस्कांसोबत खेळणी वाटून घेतो/घेते?",
      },
      {
        id: 19,
        question: "खेळताना स्वतःची पाळी येईपर्यंत वाट पाहता येते?",
      },
      {
        id: 20,
        question: "आनंद, दुःख, राग अशा साध्यासोप्या भावना ओळताना आणि प्रकट करता येतात?",
      },
      // सर्जनशीलता
      {
        id: 21,
        question: "नवीन गोष्टी शिकायचे कुतूहल असते आणि त्यात रस घेतो/घेते?",
      },
      {
        id: 22,
        question: "खोटेखोटे नाटक करत खेळायला आवडते, जसे की बाहुलीघरात खेळणे, दुकानदार असल्याचे नाटक करणे, इ?",
      },
      {
        id: 23,
        question: "दैनंदिन गोष्टींमध्ये कल्पकता दाखवतो/दाखवते (उदा. वस्तूंचे किंवा शब्दांचे वेगळ्या, नव्या प्रकारे प्रयोग करून पाहणे?",
      },
      {
        id: 24,
        question: "नृत्य, नाटक, संगीताच्या उपक्रमांत सहभाग घेतो?",
      },
      {
        id: 25,
        question: "चित्र काढताना, कलानिर्मितीत आणि एखादा प्रश्न सोडवताना कल्पनाशक्तीचा वापर करता येतो?",
      },

  ]


 export  const age5TO6=[
    {
        id: 1,
        question: "सांधिक खेळांत आणि वर्गात खेळताना सक्रियपणे सहभागी होता येते ?",
      },
      {
        id: 2,
        question: "सागितलेल्या दिशेने चेंडू फेकता / लाथेने मारता येतो?",
      },
      {
        id: 3,
        question: "सरळ पुढे / उलटे मागे / एका बाजूला चालता येते ?",
      },
      {
        id: 4,
        question: "मणी ओवून विशिष्ट रचना करता येते?",
      },
      {
        id: 5,
        question: "ठिपके जाडून गुंतागुंतीची आकृती काढता येते?",
      },
      // ज्ञानेंद्रियांचा, संवेदनात्मक व बोधात्मक विकास
      {
        id: 6,
        question: "वास, चवी आणि पोत इ. नुसार वेगवेगळ्या वस्तूंचे वर्गीकरण करता येते?",
      },
      {
        id: 7,
        question: "तीन संकल्पनांनुसार आकार, रंग व लहानमोठया | आकारमानानुसार वस्तुंचे वर्गीकरण करता येते उदा. लहान पिवळे गोल?",
      },
      {
        id: 8,
        question: "गुंतागुंतीचा आकृतीबंध पॅटर्न पूर्ण करता येतो?",
      },
      {
        id: 9,
        question: "दोन चित्रांमधले फरक शोधता येतात ?",
      },
      {
        id: 10,
        question: "१० पर्यंत अंकज्ञान ओळखणे व वाचणे?",
      },
      // भाषा, साक्षरता आणि संवाद
      {
        id: 11,
        question: "संभाषणे आणि गोष्टी लक्षपूर्वक ऐकतो/ ऐकते?",
      },
      {
        id: 12,
        question: "भावना आणि कल्पना इतरांना सांगून / इतरांसमोर मांडून गोष्ट तयार करण्यात सहभाग घेतो/घेते?",
      },
      {
        id: 13,
        question: "पुस्तके व इतर छापील साहित्य पाहायला आवडते आणि काही ओळखीचे शब्द ओळखता येतात?",
      },
      {
        id: 14,
        question: "पुस्तके, इतर छापील साहित्य पाहायला आवडते व छापलेल्या शाब्दांची उकल करण्यात रस घेतो?",
      },
      {
        id: 15,
        question: "अक्षरे व त्या संबंधी आवाज ओळखणे?",
      },
      // वैयक्तिक- सामाजिक व भावनिक विकास
      {
        id: 16,
        question: "नियम असलेल्या खेळांमध्ये संघाचा सदस्य म्हणून खेळता येते?",
      },
      {
        id: 17,
        question: "ओळखीच्या लोकांशी सहज संवाद साधता येतो?",
      },
      {
        id: 18,
        question: "मित्र / समवयस्कांसोबत सहज खेळणी वाटून घेतो ?",
      },
      {
        id: 19,
        question: "खेळताना स्वतःची पाळी येईपर्यंत वाट पाहता येते?",
      },
      {
        id: 20,
        question: "आनंद, दुःख, राग अशा साध्यासोप्या भावना ओळताना आणि प्रकट करता येतात?",
      },
      // सर्जनशीलता
      {
        id: 21,
        question: "नवीन गोष्टी शिकायचे कुतूहल असते आणि त्यात रस घेतो/घेते?",
      },
      {
        id: 22,
        question: "खोटेखोटे नाटक करत खेळायला आवडते, जसे की बाहुलीघरात खेळणे, दुकानदार असल्याचे नाटक करणे, इ?",
      },
      {
        id: 23,
        question: "दैनंदिन गोष्टींमध्ये कल्पकता दाखवतो/दाखवते (उदा. दिलेल्या साहित्यातून विविध वस्तू बनवू शकतो)?",
      },
      {
        id: 24,
        question: "नृत्य, नाटक, संगीताच्या उपक्रमांत सहभाग घेतो?",
      },
      {
        id: 25,
        question: "चित्र काढताना, कलानिर्मितीत आणि एखादा प्रश्न सोडवताना कल्पनाशक्तीचा वापर करता येतो?",
      },
  ]









